vyomkeshj/esp32_openai_firmware/src/Audio.cpp
// audio.cpp — unified “talking” mode (mic always on during playback)
// Minimal changes to make barge-in work reliably:
// • Mic now streams ALWAYS (even during playback).
// • Removed wsMutex lock around webSocket.loop() to prevent starvation.
// • WebsocketStream send now briefly waits for the mutex instead of dropping immediately.
// • Speaker playback is gated by `playbackActive`; DeviceState kept for compatibility.

#include "OTA.h"
#include <Arduino.h>
#include <driver/rtc_io.h>
#include "LEDHandler.h"
#include "Config.h"
#include "SPIFFS.h"
#include "WifiManager.h"
#include <driver/touch_sensor.h>
#include "Button.h"
#include "FactoryReset.h"
#include <ArduinoJson.h>
#include <WebSocketsClient.h>
#include "AudioTools.h"
#include "AudioTools/AudioCodecs/CodecOpus.h"
#include "Audio.h"
#include "PitchShift.h"
#include <ESP32-SpeexDSP.h>
#include <math.h>

// Some SDKs name the I2S "standard/Philips" format differently.
#ifndef I2S_STD_FORMAT
#define I2S_STD_FORMAT I2S_PHILIPS_FORMAT
#endif

// ---------------- TUNABLES ----------------
static constexpr uint32_t MIC_WARMUP_MS    = 30;   // shorter so TX starts quickly
static constexpr uint32_t IGNORE_STALE_MS  = 700;  // ignore stale server events after an interrupt

// ---------------- WEBSOCKET ----------------
SemaphoreHandle_t wsMutex;
WebSocketsClient webSocket;

// ---------------- TASK HANDLES ----------------
TaskHandle_t speakerTaskHandle = NULL;
TaskHandle_t micTaskHandle     = NULL;
TaskHandle_t networkTaskHandle = NULL;
TaskHandle_t vadTaskHandle     = NULL;

// ---------------- TIMING REGISTERS ----------------
volatile bool     scheduleListeningRestart = false;
unsigned long     scheduledTime            = 0;
unsigned long     speakingStartTime        = 0;

// brief mute window after (re)entering LISTENING to let server cancel TTS
volatile uint32_t micTxUnmuteAt = 0; // millis() when mic TX is allowed

// Interrupt window to ignore stale events right after a local/user interrupt
volatile bool     interrupting       = false;
volatile uint32_t ignoreServerUntil  = 0;

// ---------------- AUDIO SETTINGS ----------------
int   currentVolume      = 70;
float currentPitchFactor = 1.0f;
const int CHANNELS       = 1;  // Mono
const int BITS_PER_SAMPLE= 16; // 16-bit audio (expected by server)

// ---------------- VAD (Voice Activity Detection) ----------------
ESP32SpeexDSP dsp;
bool vadEnabled = false;

// ---------------- AUDIO OUTPUT ----------------
BufferRTOS<uint8_t> audioBuffer(AUDIO_BUFFER_SIZE, AUDIO_CHUNK_SIZE); // SPSC
I2SStream i2s; // speaker I2S

// Gate for speaker playback independent of DeviceState.
// Mic is always on; this only controls pulling/playing TTS.
volatile bool playbackActive = false;

class BufferPrint : public Print {
public:
  BufferPrint(BufferRTOS<uint8_t>& buf) : _buffer(buf) {}

  size_t write(uint8_t data) override {
    if (webSocket.isConnected() && playbackActive) {
      return _buffer.writeArray(&data, 1);
    }
    return 1;
  }

  size_t write(const uint8_t *buffer, size_t size) override {
    if (webSocket.isConnected() && playbackActive) {
      return _buffer.writeArray(buffer, size);
    }
    return size;
  }

private:
  BufferRTOS<uint8_t>& _buffer;
};

BufferPrint      bufferPrint(audioBuffer);
OpusAudioDecoder opusDecoder;  // guarded by wsMutex

// OLD with no pitch shift
VolumeStream          volume(i2s);
QueueStream<uint8_t>  queue(audioBuffer);
StreamCopy            copier(volume, queue);

// NEW for pitch shift (lossy)
PitchShiftFixedOutput pitchShift(i2s);
VolumeStream          volumePitch(pitchShift);
StreamCopy            pitchCopier(volumePitch, queue);

AudioInfo info(SAMPLE_RATE, CHANNELS, BITS_PER_SAMPLE);
volatile bool i2sOutputFlushScheduled = false;
volatile bool i2sInputFlushScheduled  = false;

// ---------------- HELPERS ----------------
static inline bool timeIsBefore(uint32_t deadline_ms) {
  // true if millis() < deadline_ms (handles wrap safely)
  return (int32_t)(millis() - deadline_ms) < 0;
}

static inline bool ignoreStaleActive() {
  return interrupting && timeIsBefore(ignoreServerUntil);
}

unsigned long getSpeakingDuration() {
  if (playbackActive && speakingStartTime > 0) {
    return millis() - speakingStartTime;
  }
  return 0;
}

static void sendInterruptInstruction(unsigned long audioEndMs = 0) {
  // Tell the server to cancel/interrupt its current response.
  JsonDocument j; // v7 style
  j["type"] = "instruction";
  j["msg"]  = "INTERRUPT";
  if (audioEndMs > 0) j["audio_end_ms"] = audioEndMs;

  char buf[192];
  size_t n = serializeJson(j, buf, sizeof(buf));
  if (webSocket.isConnected()) {
    if (xSemaphoreTake(wsMutex, 50 / portTICK_PERIOD_MS) == pdTRUE) {
      webSocket.sendTXT((uint8_t*)buf, n);
      xSemaphoreGive(wsMutex);
    }
  }
}

// ---------------- STATE/PLAYBACK TRANSITIONS ----------------
// We keep DeviceState for compatibility (LEDs/other modules).
// “Talking mode” = mic always on; playback toggled via `playbackActive`.

void transitionToSpeaking() {
  // Enable playback, keep mic running (full-duplex)
  vTaskDelay(50);
  i2sInputFlushScheduled = true; // drop any mic backlog; stream continues
  playbackActive = true;
  deviceState = SPEAKING;        // legacy state for external modules
  digitalWrite(I2S_SD_OUT, HIGH);
  speakingStartTime = millis();
  Serial.println("Transitioned to talking mode (playback ON, mic ON)");
}

void transitionToListening() {
  // Playback off; mic continues streaming.
  const bool wasScheduled = scheduleListeningRestart;

  deviceState = PROCESSING;
  scheduleListeningRestart = false;
  Serial.println("Transitioning to talking mode (playback OFF, mic ON)");

  // Stop playback pipeline & flush
  playbackActive = false;
  i2sInputFlushScheduled  = true;
  i2sOutputFlushScheduled = true;

  // Clear the audio buffer to stop any pending audio
  audioBuffer.clear();

  // Give pipelines a tick to settle
  vTaskDelay(50);

  deviceState = LISTENING;

  // Short warm-up mute so TX starts cleanly
  micTxUnmuteAt = millis() + MIC_WARMUP_MS;

  // Start "ignore stale" window only if this wasn't scheduled (likely a user barge-in)
  if (!wasScheduled) {
    interrupting      = true;
    ignoreServerUntil = millis() + IGNORE_STALE_MS;
    Serial.println("Talking (interrupt window active)");
  } else {
    interrupting = false;
    Serial.println("Talking (scheduled)");
  }

  Serial.println("Transitioned to talking mode (playback OFF, mic ON)");
}

// ---------------- SPEAKER PIPELINE ----------------
void audioStreamTask(void *parameter) {
  Serial.println("Starting I2S stream pipeline...");

  pinMode(I2S_SD_OUT, OUTPUT);
  digitalWrite(I2S_SD_OUT, HIGH);

  OpusSettings cfg;
  cfg.sample_rate     = SAMPLE_RATE;
  cfg.channels        = CHANNELS;
  cfg.bits_per_sample = BITS_PER_SAMPLE;
  cfg.max_buffer_size = 6144;

  xSemaphoreTake(wsMutex, portMAX_DELAY);
  opusDecoder.setOutput(bufferPrint);
  opusDecoder.begin(cfg);
  xSemaphoreGive(wsMutex);

  audioBuffer.setReadMaxWait(0);
  queue.begin();

  auto config = i2s.defaultConfig(TX_MODE);
  config.bits_per_sample = BITS_PER_SAMPLE;
  config.sample_rate     = SAMPLE_RATE;
  config.channels        = CHANNELS;
  config.pin_bck         = I2S_BCK_OUT;
  config.pin_ws          = I2S_WS_OUT;
  config.pin_data        = I2S_DATA_OUT;
  config.port_no         = I2S_PORT_OUT;
  config.copyFrom(info);
  i2s.begin(config);

