vyomkeshj/esp32_openai_firmware/src/Audio.cpp
  auto vcfg = volume.defaultConfig();
  vcfg.copyFrom(info);
  vcfg.allow_boost = true;
  volume.begin(vcfg);

  auto vcfgPitch = volumePitch.defaultConfig();
  vcfgPitch.copyFrom(info);
  vcfgPitch.allow_boost = true;
  volumePitch.begin(vcfgPitch);

  while (1) {
    if (i2sOutputFlushScheduled) {
      i2sOutputFlushScheduled = false;
      i2s.flush();
      volume.flush();
      volumePitch.flush();
      queue.flush();
    }

    if (webSocket.isConnected() && playbackActive) {
      if (currentPitchFactor != 1.0f) {
        pitchCopier.copy();
      } else {
        copier.copy();
      }
    } else {
      // Always drain queue to keep producer from blocking
      queue.read();
    }
    vTaskDelay(1);
  }
}

// ---------------- MIC → WS PIPELINE ----------------
// Stereo capture for 2x INMP441 on one I2S bus (Left=near, Right=ref)
// 20 ms @ 16 kHz => 320 samples per channel; stereo bytes = 320 * 2ch * 2B = 1280
const int MIC_COPY_SAMPLES = 960;           // per-channel samples for 20 ms @ 16 kHz
const int MIC_STEREO_BYTES = MIC_COPY_SAMPLES * 2 /*ch*/ * sizeof(int16_t);

// Shared buffer for VAD processing (AEC-filtered audio)
int16_t sharedVadBuffer[MIC_COPY_SAMPLES];
volatile bool newVadData = false;

class WebsocketStream : public Print {
public:
  size_t write(uint8_t b) override {
    if (!canSend()) return 1;
    // Briefly wait for the mutex to avoid starvation during playback
    if (xSemaphoreTake(wsMutex, 2 / portTICK_PERIOD_MS) != pdTRUE) return 1;
    webSocket.sendBIN(&b, 1);
    xSemaphoreGive(wsMutex);
    return 1;
  }

  size_t write(const uint8_t *buffer, size_t size) override {
    if (size == 0 || !canSend()) return size;
    
    // Briefly wait for the mutex to avoid starvation during playback
    if (xSemaphoreTake(wsMutex, 2 / portTICK_PERIOD_MS) != pdTRUE) return size;
    webSocket.sendBIN(buffer, size);
    xSemaphoreGive(wsMutex);
    return size;
  }

private:
  inline bool canSend() const {
    if (!webSocket.isConnected())   return false;
    if (timeIsBefore(micTxUnmuteAt)) return false; // warm-up mute
    // MIC IS ALWAYS ON in talking mode: do NOT gate on DeviceState
    return true;
  }
};

WebsocketStream wsStream;
I2SStream i2sInput; // mic I2S
// StreamCopy no longer used; we do AEC then push to wsStream directly
// StreamCopy micToWsCopier(wsStream, i2sInput);

void micTask(void *parameter) {
  // --- Configure I2S RX as STEREO: Right(near), Left(reference) ---
  auto i2sConfig = i2sInput.defaultConfig(RX_MODE);
  i2sConfig.bits_per_sample  = BITS_PER_SAMPLE;     // 16-bit PCM expected by server
  i2sConfig.sample_rate      = SAMPLE_RATE;         // e.g. 16000
  i2sConfig.channels         = 2;                   // STEREO capture
  i2sConfig.i2s_format       = I2S_STD_FORMAT;      // Philips
  i2sConfig.channel_format   = I2S_CHANNEL_FMT_RIGHT_LEFT; // Stereo: separated left and right channels
  // NOTE: This gives us Left, Right interleaved data for stereo capture

  i2sConfig.pin_bck  = I2S_SCK;
  i2sConfig.pin_ws   = I2S_WS;
  i2sConfig.pin_data = I2S_SD;
  i2sConfig.port_no  = I2S_PORT_IN;

  i2sInput.begin(i2sConfig);
  Serial.println("I2S configured for stereo capture (Left=near, Right=reference)");

  // --- AEC init (SpeexDSP) ---
  static bool aecInitialized = false;
  const int aecFrame = MIC_COPY_SAMPLES;            // 20 ms frames
  const int aecFilterLen = 1024;                    // tail (~64 ms @ 16 kHz); adjust if needed
  if (!aecInitialized) {
    Serial.printf("Initializing AEC: enabled=%d, delay=%dms, gain=%.2f\n", 
                  echoCancellationEnabled, echoCancellationDelay, echoCancellationGain);
    if (!dsp.beginAEC(aecFrame, aecFilterLen, SAMPLE_RATE)) {
      Serial.println("AEC initialization failed! Continuing without AEC.");
      aecInitialized = false;
    } else {
      aecInitialized = true;
      Serial.printf("AEC initialized: frame=%d, tail=%d, fs=%d\n", aecFrame, aecFilterLen, SAMPLE_RATE);
    }
  }

  // Optional preprocessing on mic path (denoise/AGC/VAD) AFTER AEC
  // Temporarily disabled to reduce CPU load and prevent audio playback issues
  static bool preInitialized = false;
  // if (!preInitialized) {
  //   if (dsp.beginMicPreprocess(aecFrame, SAMPLE_RATE)) {
  //     dsp.enableMicNoiseSuppression(true);
  //     dsp.setMicNoiseSuppressionLevel(-15);
  //     // dsp.enableAGC(true, 0.9f);
  //     // VAD here is optional for gating TX; we keep mic always on.
  //     preInitialized = true;
  //     Serial.println("Preprocess initialized (NS -15dB, AGC 0.9)");
  //   }
  // }

  // --- Reference delay line (to match acoustic path), uses echoCancellationDelay (ms) ---
  const int maxDelayMs = 200; // safety cap
  const int maxDelaySamples = (SAMPLE_RATE * maxDelayMs) / 1000;
  static int16_t refDelayBuf[2048];                 // >= maxDelaySamples, power-of-two is fine
  static size_t  refDelayHead = 0;
  const size_t   refDelayCap  = sizeof(refDelayBuf) / sizeof(refDelayBuf[0]);
  auto applyRefDelay = [&](const int16_t* in, int count, int16_t* out) {
    // write current ref to ring; read delayed copy
    int wantDelay = echoCancellationDelay;          // milliseconds, provided externally
    if (wantDelay < 0) wantDelay = 0;
    if (wantDelay > maxDelayMs) wantDelay = maxDelayMs;
    const int dSamp = (SAMPLE_RATE * wantDelay) / 1000;
    for (int i = 0; i < count; ++i) {
      // push current sample
      refDelayBuf[refDelayHead] = in[i];
      // read delayed sample
      size_t rd = (refDelayHead + refDelayCap - (size_t)dSamp) % refDelayCap;
      int32_t s = refDelayBuf[rd];
      // optional reference gain trim
      if (echoCancellationGain > 0.0f && echoCancellationGain != 1.0f) {
        s = (int32_t)((float)s * echoCancellationGain);
        if (s > 32767) s = 32767; else if (s < -32768) s = -32768;
      }
      out[i] = (int16_t)s;
      // advance head
      refDelayHead = (refDelayHead + 1) % refDelayCap;
    }
  };

  // --- Buffers ---
  static int16_t interleaved[2 * MIC_COPY_SAMPLES]; // [L,R,L,R,...] after read (we'll map correctly)
  static int16_t micNear[MIC_COPY_SAMPLES];
  static int16_t refRaw[MIC_COPY_SAMPLES];
  static int16_t refDelayed[MIC_COPY_SAMPLES];
  static int16_t aecOut[MIC_COPY_SAMPLES];
  static int16_t postProc[MIC_COPY_SAMPLES];

  while (1) {
    if (i2sInputFlushScheduled) {
      i2sInputFlushScheduled = false;
      i2sInput.flush();
    }

    if (!webSocket.isConnected()) {
      vTaskDelay(10);
      continue;
    }

    // --- Read one 20 ms stereo frame ---
    size_t got = i2sInput.readBytes((uint8_t*)interleaved, MIC_STEREO_BYTES);
    if (got < (size_t)MIC_STEREO_BYTES) {
      vTaskDelay(1);
      continue;
    }

    // --- Deinterleave: Right = near mic, Left = reference mic ---
    // NOTE: Hardware has Right=voice, Left=reference (opposite of expected)
    for (int i = 0, j = 0; i < MIC_COPY_SAMPLES; ++i, j += 2) {
      int16_t l = interleaved[j + 0]; // Left slot (reference mic)
      int16_t r = interleaved[j + 1]; // Right slot (near mic - voice)
      micNear[i] = r;  // Right channel is the near microphone
      refRaw[i]  = l;  // Left channel is the reference microphone
    }
    
    // Debug: Print channel levels and AEC status occasionally (every 50 frames = 1 second)
    static int debugCounter = 0;
    static unsigned long lastDebugTime = 0;
    if (++debugCounter >= 50) {
      debugCounter = 0;
      unsigned long now = millis();
      long nearSum = 0, refSum = 0;
      for (int i = 0; i < MIC_COPY_SAMPLES; i++) {
        nearSum += abs(micNear[i]);  // Right channel (voice)
        refSum += abs(refRaw[i]);    // Left channel (reference)
      }
      Serial.printf("Channels - Right(near): %ld, Left(ref): %ld, AEC: %s, FPS: %.1f\n", 
                    nearSum, refSum, 
                    (echoCancellationEnabled && aecInitialized) ? "ON" : "OFF",
                    lastDebugTime > 0 ? 50000.0 / (now - lastDebugTime) : 0.0);
      lastDebugTime = now;
    }

    // --- Reference alignment & gain ---
    // Temporarily bypass delay processing to test
    memcpy(refDelayed, refRaw, MIC_COPY_SAMPLES * sizeof(int16_t));
    // applyRefDelay(refRaw, MIC_COPY_SAMPLES, refDelayed);

    // --- AEC (if enabled and initialized), else pass-through near ---
    // Temporarily disable AEC to test if it's causing choppy audio
    bool useAEC = false; // Set to true to enable AEC: echoCancellationEnabled && aecInitialized;
    
    if (useAEC) {
      dsp.processAEC(micNear, refDelayed, aecOut);
      // Debug: Show AEC is active occasionally (every 5 seconds)
      static int aecDebugCounter = 0;
      if (++aecDebugCounter >= 250) { // Every 5 seconds (250 frames * 20ms = 5s)
        aecDebugCounter = 0;
        Serial.println("AEC processing active");
      }
    } else {
      memcpy(aecOut, micNear, MIC_COPY_SAMPLES * sizeof(int16_t));
      // Debug: Show AEC is bypassed occasionally (every 5 seconds)
      static int bypassDebugCounter = 0;
      if (++bypassDebugCounter >= 250) { // Every 5 seconds (250 frames * 20ms = 5s)
        bypassDebugCounter = 0;
        Serial.printf("AEC bypassed - enabled:%d, initialized:%d\n", echoCancellationEnabled, aecInitialized);
      }
    }

    // --- Copy AEC output to shared VAD buffer ---
    memcpy(sharedVadBuffer, aecOut, MIC_COPY_SAMPLES * sizeof(int16_t));
    newVadData = true;

