vyomkeshj/esp32_openai_firmware/src/Audio.cpp
    // --- Send AEC-filtered mono frame to server ---
    if (!timeIsBefore(micTxUnmuteAt)) {
      wsStream.write((uint8_t*)aecOut, MIC_COPY_SAMPLES * sizeof(int16_t));
    }
    vTaskDelay(1); // Reduced delay to prevent choppy audio
  }
}

// ---------------- VAD TASK ----------------
void vadTask(void *parameter) {
  Serial.println("Starting VAD task...");
  
  // Initialize SpeexDSP preprocessing for VAD
  if (!dsp.beginMicPreprocess(MIC_COPY_SAMPLES, SAMPLE_RATE)) {
    Serial.println("VAD preprocessing initialization failed!");
    vTaskDelete(NULL);
    return;
  }
  
  dsp.enableMicVAD(true);
  dsp.setMicVADThreshold(90); // Much less sensitive
  dsp.enableMicNoiseSuppression(true);
  dsp.setMicNoiseSuppressionLevel(-20);
  Serial.println("VAD initialized on AEC-filtered audio (low priority, less sensitive)");
  
  while (1) {
    if (vadEnabled && newVadData) {
      // Small delay to ensure audio playback gets priority
      vTaskDelay(5);
      
      // Process AEC-filtered audio from shared buffer
      dsp.preprocessMicAudio(sharedVadBuffer);
      
      // Check for voice activity
      if (dsp.isMicVoiceDetected()) {
        static unsigned long lastVADTime = 0;
        static unsigned long voiceDetectedTime = 0;
        unsigned long now = millis();
        
        if (now - lastVADTime > 3000) { // 3 second debounce - much less aggressive
          lastVADTime = now;
          voiceDetectedTime = now;
          Serial.println("Voice detected on AEC-filtered audio! Stopping playback");
          
          // Stop playback
          playbackActive = false;
          audioBuffer.clear();
          i2sOutputFlushScheduled = true;
          volume.flush();
          volumePitch.flush();
          queue.flush();
        }
        
        // Re-enable playback after 2 seconds of silence
        if (voiceDetectedTime > 0 && now - voiceDetectedTime > 2000) {
          playbackActive = true;
          voiceDetectedTime = 0;
          Serial.println("Re-enabling playback");
        }
      }
      
      newVadData = false; // Mark data as processed
      vTaskDelay(20); // Longer delay after processing to give other tasks CPU time
    } else {
      // No new data or VAD disabled, wait much longer to reduce CPU usage
      vTaskDelay(100);
    }
  }
}

// ---------------- WS EVENTS ----------------
void webSocketEvent(WStype_t type, uint8_t *payload, size_t length)
{
  switch (type)
  {
  case WStype_DISCONNECTED:
    Serial.printf("[WSc] Disconnected!\n");
    playbackActive = false;
    deviceState = IDLE;
    break;

  case WStype_CONNECTED:
    Serial.printf("[WSc] Connected to url: %s\n", payload);
    // Enter talking baseline (mic on, playback off)
    playbackActive = false;
    deviceState = PROCESSING;
    // allow immediate mic TX after connect
    micTxUnmuteAt = millis();
    break;

  case WStype_TEXT: {
    Serial.printf("[WSc] get text: %s\n", payload);

    JsonDocument doc; // v7 style
    DeserializationError error = deserializeJson(doc, (char*)payload);
    if (error) {
      Serial.println("Error deserializing JSON");
      deviceState = IDLE;
      return;
    }

    String type = doc["type"].as<String>();

    // auth
    if (type == "auth") {
      if (doc["volume_control"].is<int>()) {
        currentVolume = doc["volume_control"].as<int>();
        volume.setVolume(currentVolume / 100.0f);
        volumePitch.setVolume(currentVolume / 100.0f);
      }
      if (doc["pitch_factor"].is<float>()) {
        currentPitchFactor = doc["pitch_factor"].as<float>();
        if (currentPitchFactor != 1.0f) {
          auto pcfg = pitchShift.defaultConfig();
          pcfg.copyFrom(info);
          pcfg.pitch_shift = currentPitchFactor;
          pcfg.buffer_size = 512;
          pitchShift.begin(pcfg);
        }
      }
      bool is_ota   = doc["is_ota"].is<bool>()   ? doc["is_ota"].as<bool>()   : false;
      bool is_reset = doc["is_reset"].is<bool>() ? doc["is_reset"].as<bool>() : false;

      if (is_ota)  { Serial.println("OTA update received"); setOTAStatusInNVS(OTA_IN_PROGRESS); ESP.restart(); }
      if (is_reset){ Serial.println("Factory reset received"); ESP.restart(); }
    }

    // server
    if (type == "server") {
      String msg = doc["msg"].as<String>();
      Serial.println(msg);

      const bool ignoreStale = ignoreStaleActive();

      if (msg == "USER.SPEECH.START") {
        // Flush any pending TTS; keep mic streaming and inform server
        i2sOutputFlushScheduled = true;
        if (playbackActive) {
          unsigned long ms = getSpeakingDuration();
          transitionToListening();   // playback OFF, mic ON
          sendInterruptInstruction(ms);
        } else {
          transitionToListening();   // ensure clean state
        }

      } else if (msg == "RESPONSE.COMPLETE" || msg == "RESPONSE.ERROR") {
        if (doc["volume_control"].is<int>()) {
          int newVolume = doc["volume_control"].as<int>();
          volume.setVolume(newVolume / 100.0f);
          volumePitch.setVolume(newVolume / 100.0f);
        }

        // If we're within ignore window, do nothing; else schedule a tidy playback-off transition.
        if (!ignoreStale && playbackActive == true) {
          scheduleListeningRestart = true;
          scheduledTime = millis() + 1000;
        } else {
          scheduleListeningRestart = false;
        }

      } else if (msg == "AUDIO.COMMITTED") {
        // Only allow this to push us toward PROCESSING if we were actually playing back and not ignoring stale events
        if (!ignoreStale && playbackActive) {
          deviceState = PROCESSING;
        }

      } else if (msg == "RESPONSE.CREATED") {
        // Start playback for this fresh response (mic stays on)
        if (!ignoreStale) {
          transitionToSpeaking(); // playback ON, mic ON
        }

      } else if (msg == "CLEAR_BUFFER") {
        Serial.println("Received CLEAR_BUFFER, clearing audio buffer and stopping playback");
        // Stop playback immediately
        playbackActive = false;
        // Clear the audio buffer to stop any pending audio
        audioBuffer.clear();
        // Flush the I2S output to immediately stop speaker audio
        i2sOutputFlushScheduled = true;
        // Also flush volume streams immediately for instant audio stop
        i2s.flush();
        volume.flush();
        volumePitch.flush();
        queue.flush();
        
