vyomkeshj/esp32_openai_firmware/src/Audio.cpp
      } else if (msg == "SESSION.END") {
        Serial.println("Received SESSION.END, going to sleep");
        playbackActive = false;
        sleepRequested = true;
      }
    }
  } break;

  case WStype_BIN: {
    if (scheduleListeningRestart) {
      if (playbackActive) {
        i2sOutputFlushScheduled = true;
        transitionToListening();  // playback OFF, mic ON
      }
      break;
    }

    if (!playbackActive) {
      // Drop assistant audio unless we are in playback
      break;
    }

    size_t processed = opusDecoder.write(payload, length);
    if (processed != length) {
      Serial.printf("Warning: Only processed %u/%u bytes\n", (unsigned)processed, (unsigned)length);
    }
  } break;

  case WStype_ERROR:
    Serial.printf("[WSc] Error: %s\n", payload);
    break;

  case WStype_FRAGMENT_TEXT_START:
  case WStype_FRAGMENT_BIN_START:
  case WStype_FRAGMENT:
  case WStype_PONG:
  case WStype_PING:
  case WStype_FRAGMENT_FIN:
    break;
  }
}

// ---------------- WS BOOTSTRAP ----------------
void websocketSetup(String server_domain, int port, String path)
{
  String headers = "Authorization: Bearer " + String(authTokenGlobal);

  xSemaphoreTake(wsMutex, portMAX_DELAY);
  webSocket.setExtraHeaders(headers.c_str());
  webSocket.onEvent(webSocketEvent);
  webSocket.setReconnectInterval(1000);
  webSocket.disableHeartbeat();

#ifdef DEV_MODE
  webSocket.begin(server_domain.c_str(), port, path.c_str());
#else
  webSocket.beginSslWithCA(server_domain.c_str(), port, path.c_str(), CA_cert);
#endif

  xSemaphoreGive(wsMutex);
}

// ---------------- NETWORK LOOP ----------------
void networkTask(void *parameter) {
  while (1) {
    // Do NOT hold wsMutex while looping; this starves mic send during playback.
    if (scheduleListeningRestart && millis() >= scheduledTime) {
      transitionToListening(); // playback OFF, mic ON
    }

    webSocket.loop();
    vTaskDelay(1);
  }
}
